OpenFOAM-6-cantera/tutorials/heatTransfer/chtMultiRegionFoam/multiRegionHeaterRadiation/constant/bottomAir/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation       on;

radiationModel  viewFactor;

viewFactorCoeffs
{
    smoothing true; // Smooth view factor matrix (use when in a close surface
                    // to force Sum(Fij = 1)
    constantEmissivity true; // constant emissivity on surfaces.
}

// Number of flow iterations per radiation iteration
solverFreq 3;

absorptionEmissionModel constantAbsorptionEmission;

constantAbsorptionEmissionCoeffs
{
    absorptivity    absorptivity    [0 -1 0 0 0 0 0] 0.01;
    emissivity      emissivity      [0 -1 0 0 0 0 0] 0.01;
    E               E               [1 -1 -3 0 0 0 0] 0;
}

scatterModel    none;

sootModel       none;

// ************************************************************************* //
